1. Tampilkan semua nilai pada kolom ‘parental level of education’ dan jumlah rownya pada dataset yang diberikan.

Dataset yang digunakan adalah StudentsPerformance.csv (link to dataset: https://www.kaggle.com/spscientist/students-performance-in-exams)

In [ ]:
import pandas as pd
df_student = pd.read_csv('/content/StudentsPerformance.csv')
df_student

     gender race/ethnicity  ... reading score writing score
0    female        group B  ...            72            74
1    female        group C  ...            90            88
2    female        group B  ...            95            93
3      male        group A  ...            57            44
4      male        group C  ...            78            75
..      ...            ...  ...           ...           ...
995  female        group E  ...            99            95
996    male        group C  ...            55            55
997  female        group C  ...            71            65
998  female        group D  ...            78            77
999  female        group D  ...            86            86

[1000 rows x 8 columns]

In [ ]:
ploe = df_student['parental level of education']
ploe.head()

0     bachelor's degree
1          some college
2       master's degree
3    associate's degree
4          some college
Name: parental level of education, dtype: object

2. Buatlah satu kolom baru ‘avg_score’ yang akan menampilkan rata-rata Writing, Math, dan Reading score untuk masing-masing siswa

In [ ]:
df_student['avg_score'] = df_student.mean(numeric_only=True, axis=1)
df_student['avg_score']

0      72.666667
1      82.333333
2      92.666667
3      49.333333
4      76.333333
         ...
995    94.000000
996    57.333333
997    65.000000
998    74.333333
999    83.000000
Name: avg_score, Length: 1000, dtype: float64

3. Menggunakan kolom baru tersebut, hitung rata-rata score untuk masing-masing gender

In [ ]:
df_student

     gender race/ethnicity  ... writing score  avg_score
0    female        group B  ...            74  72.666667
1    female        group C  ...            88  82.333333
2    female        group B  ...            93  92.666667
3      male        group A  ...            44  49.333333
4      male        group C  ...            75  76.333333
..      ...            ...  ...           ...        ...
995  female        group E  ...            95  94.000000
996    male        group C  ...            55  57.333333
997  female        group C  ...            65  65.000000
998  female        group D  ...            77  74.333333
999  female        group D  ...            86  83.000000

[1000 rows x 9 columns]

In [ ]:
df_student.groupby(by='gender')['avg_score'].agg('mean')

gender
female    69.569498
male      65.837483
Name: avg_score, dtype: float64

Insight dari materi intermediate dataframe ini adalah dapat mengetahui penggunaan dari groupby dan aggregate. Fungsi GroupBy() dapat digunakan untuk mengelompokkan data dalam kumpulan item yang sama misalnya dalam lokasi, produk, tingkat pendidikan, jenis kelamin, dan lainnya.